In [1]:
# importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import statistics as stats

In [31]:
df=pd.read_csv('fish_capture.csv')

In [32]:
df.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021
0,Aruba,ABW,Capture fisheries production (metric tons),ER.FSH.CAPT.MT,200.0,200.0,300.0,300.0,300.0,300.0,...,138.00,145.00,152.00,150.00,150.00,149.00,149.00,163.00,155.00,NaN
1,Africa Eastern and Southern,AFE,Capture fisheries production (metric tons),ER.FSH.CAPT.MT,1485740.0,1632169.0,1735664.0,1848486.0,2164132.0,2174850.0,...,3823494.99,3701198.31,3927435.12,4033890.26,4188878.44,4210226.37,4149011.16,4220081.72,4192288.05,NaN
2,Afghanistan,AFG,Capture fisheries production (metric tons),ER.FSH.CAPT.MT,200.0,300.0,300.0,300.0,300.0,300.0,...,1300.00,1450.00,1600.00,1750.00,1900.00,2000.00,2050.00,2100.00,2000.00,NaN
3,Africa Western and Central,AFW,Capture fisheries production (metric tons),ER.FSH.CAPT.MT,488505.0,513837.0,560769.0,582503.0,646740.0,680876.0,...,3112164.29,3172804.04,3221896.54,3156916.84,3473352.32,4126363.57,4230596.86,4015509.77,3855653.10,NaN
4,Angola,AGO,Capture fisheries production (metric tons),ER.FSH.CAPT.MT,257300.0,246800.0,274800.0,245300.0,362000.0,263300.0,...,374000.00,407000.00,442084.00,495232.00,486490.00,531575.00,443066.00,400762.00,377345.00,NaN

In [33]:
#changing date columns to rows
df=df.melt(id_vars=["Country Name", "Country Code",'Indicator Name','Indicator Code'], 
        var_name="Date", 
        value_name="captured fishes (metric tons)")

In [34]:
df= df.drop(columns= ['Indicator Name', 'Indicator Code'])

In [35]:
#checking for duplicate rows
duplicate_rows_df=df[df.duplicated()]
print("number of duplicate rows:", duplicate_rows_df.shape)

number of duplicate rows: (0, 4)

In [36]:
print(df.isnull().sum())

Country Name                        0
Country Code                        0
Date                                0
captured fishes (metric tons)    1851
dtype: int64

In [37]:
#dropping null values
df = df.dropna()

In [38]:
df.head()

,Country Name,Country Code,Date,captured fishes (metric tons)
0,Aruba,ABW,1960,200.0
1,Africa Eastern and Southern,AFE,1960,1485740.0
2,Afghanistan,AFG,1960,200.0
3,Africa Western and Central,AFW,1960,488505.0
4,Angola,AGO,1960,257300.0

## DATA FOR THE E.U

In [39]:
# Create a dataframe with only the rows for the specified EU countries and 
#sort it in ascending order by country name and date

df_eu = (df.apply(lambda row: row[df['Country Name'].isin
        (['Austria', 'Belgium', 'Bulgaria', 'Croatia','Cyprus', 'Czech Republic', 
          'Denmark', 'Estonia', 'Finland', 'France', 'Germany', 'Greece', 'Hungary', 'Ireland', 'Italy', 
          'Latvia', 'Lithuania', 'Luxembourg', 'Malta', 'Netherlands', 'Poland', 'Portugal', 'Romania',
          'Slovakia', 'Slovenia', 'Spain', 'Sweden'])])).sort_values(by=['Country Name','Date'], ascending=True)

# Print the first 5 rows of the resulting dataframe
df_eu.head()

     Country Name Country Code  Date  captured fishes (metric tons)
14        Austria          AUT  1960                         3550.0
280       Austria          AUT  1961                         3540.0
546       Austria          AUT  1962                         3830.0
812       Austria          AUT  1963                         4000.0
1078      Austria          AUT  1964                         4220.0

In [40]:
df_eu.describe().apply(lambda x: int(x), axis=1)

count       1377
mean      269246
std       371072
min          263
25%         9336
50%       135467
75%       348441
max      2013518
dtype: int64

In [2]:
pip install dash

Collecting dash
  Downloading dash-2.7.1-py3-none-any.whl (9.9 MB)
Requirement already satisfied: Flask>=1.0.4 in c:\users\user\anaconda3\lib\site-packages (from dash) (1.1.2)
Collecting dash-html-components==2.0.0
  Downloading dash_html_components-2.0.0-py3-none-any.whl (4.1 kB)
Requirement already satisfied: plotly>=5.0.0 in c:\users\user\anaconda3\lib\site-packages (from dash) (5.6.0)
Collecting dash-table==5.0.0
  Downloading dash_table-5.0.0-py3-none-any.whl (3.9 kB)
Collecting dash-core-components==2.0.0
  Downloading dash_core_components-2.0.0-py3-none-any.whl (3.8 kB)
Requirement already satisfied: click>=5.1 in c:\users\user\anaconda3\lib\site-packages (from Flask>=1.0.4->dash) (8.0.4)
Requirement already satisfied: itsdangerous>=0.24 in c:\users\user\anaconda3\lib\site-packages (from Flask>=1.0.4->dash) (2.0.1)
Requirement already satisfied: Werkzeug>=0.15 in c:\users\user\anaconda3\lib\site-packages (from Flask>=1.0.4->dash) (2.0.3)
Requirement already satisfied: Jinja2>=2.10.1 in c:\users\user\anaconda3\lib\site-packages (from Flask>=1.0.4->dash) (3.1.2)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from click>=5.1->Flask>=1.0.4->dash) (0.4.4)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\user\anaconda3\lib\site-packages (from Jinja2>=2.10.1->Flask>=1.0.4->dash) (2.0.1)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from plotly>=5.0.0->dash) (1.16.0)
Requirement already satisfied: tenacity>=6.2.0 in c:\users\user\anaconda3\lib\site-packages (from plotly>=5.0.0->dash) (8.0.1)
Installing collected packages: dash-table, dash-html-components, dash-core-components, dash
Successfully installed dash-2.7.1 dash-core-components-2.0.0 dash-html-components-2.0.0 dash-table-5.0.0
Note: you may need to restart the kernel to use updated packages.

In [3]:
pandas

NameError: name 'pandas' is not defined